VALID_BOOK_NAMES = [
    "1984",
    "Война и мир",
    "A" * 40,
    "Гарри Поттер и философский камень",
]

INVALID_BOOK_NAMES = [
    "",
    "A" * 41,
]

VALID_GENRES = ['Фантастика', 'Ужасы', 'Детективы', 'Мультфильмы', 'Комедии', 'Сказ']
INVALID_GENRES = ['Романтика', 'Биография', 'Поэзия', '', 'ужасы', 'Фэнтези', 'Любовный роман']

CHILDREN_BOOKS = {
    "Смешарики": "Мультфильмы",
    "Пеппа": "Комедии",
    "Звёздные войны": "Фантастика"
}

ADULT_BOOKS = {
    "Оно": "Ужасы",
    "Шерлок Холмс": "Детективы"
}

books = {
    "Ревизор": "Комедии",
    "Хозяйка Медной горы": "Сказ",
    "Оно": "Ужасы",
    "Шерлок Холмс": "Детективы",
    "Смешарики": "Мультфильмы",
    "Пеппа": "Комедии",
    "Звёздные войны": "Фантастика"
    }